nevinxu/HM502B2/platform/CMSIS/Include/device/MKL17Z4/MKL17Z4_flexio.h
/*
 * Constants & macros for individual FLEXIO_SHIFTSTAT bitfields
 */

/*!
 * @name Register FLEXIO_SHIFTSTAT, field SSF[3:0] (W1C)
 *
 * The shifter status flag is updated when one of the following events occurs:
 * For SMOD=Receive, the status flag is set when SHIFTBUF has been loaded with
 * data from Shifter (SHIFTBUF is full), and the status flag is cleared when
 * SHIFTBUF register is read. For SMOD=Transmit, the status flag is set when SHIFTBUF
 * data has been transferred to the Shifter (SHIFTBUF is empty) or when initially
 * configured for SMOD=Transmit, and the status flag is cleared when the SHIFTBUF
 * register is written. For SMOD=Match Store, the status flag is set when a match
 * has occured between SHIFTBUF and Shifter, and the status flag is cleared when
 * the SHIFTBUF register is read. For SMOD=Match Continuous, returns the current
 * match result between the SHIFTBUF and Shifter. The status flag can also be
 * cleared by writing a logic one to the flag for all modes except Match Continuous.
 *
 * Values:
 * - 0 - Status flag is clear
 * - 1 - Status flag is set
 */
/*@{*/
#define BP_FLEXIO_SHIFTSTAT_SSF (0U)       /*!< Bit position for FLEXIO_SHIFTSTAT_SSF. */
#define BM_FLEXIO_SHIFTSTAT_SSF (0x0000000FU) /*!< Bit mask for FLEXIO_SHIFTSTAT_SSF. */
#define BS_FLEXIO_SHIFTSTAT_SSF (4U)       /*!< Bit field size in bits for FLEXIO_SHIFTSTAT_SSF. */

/*! @brief Read current value of the FLEXIO_SHIFTSTAT_SSF field. */
#define BR_FLEXIO_SHIFTSTAT_SSF(x) (BME_UBFX32(HW_FLEXIO_SHIFTSTAT_ADDR(x), BP_FLEXIO_SHIFTSTAT_SSF, BS_FLEXIO_SHIFTSTAT_SSF))

/*! @brief Format value for bitfield FLEXIO_SHIFTSTAT_SSF. */
#define BF_FLEXIO_SHIFTSTAT_SSF(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_SHIFTSTAT_SSF) & BM_FLEXIO_SHIFTSTAT_SSF)

/*! @brief Set the SSF field to a new value. */
#define BW_FLEXIO_SHIFTSTAT_SSF(x, v) (BME_BFI32(HW_FLEXIO_SHIFTSTAT_ADDR(x), ((uint32_t)(v) << BP_FLEXIO_SHIFTSTAT_SSF), BP_FLEXIO_SHIFTSTAT_SSF, 4))
/*@}*/

/*******************************************************************************
 * HW_FLEXIO_SHIFTERR - Shifter Error Register
 ******************************************************************************/

/*!
 * @brief HW_FLEXIO_SHIFTERR - Shifter Error Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
typedef union _hw_flexio_shifterr
{
    uint32_t U;
    struct _hw_flexio_shifterr_bitfields
    {
        uint32_t SEF : 4;              /*!< [3:0] Shifter Error Flags */
        uint32_t RESERVED0 : 28;       /*!< [31:4]  */
    } B;
} hw_flexio_shifterr_t;

/*!
 * @name Constants and macros for entire FLEXIO_SHIFTERR register
 */
/*@{*/
#define HW_FLEXIO_SHIFTERR_ADDR(x) ((x) + 0x14U)

#define HW_FLEXIO_SHIFTERR(x)    (*(__IO hw_flexio_shifterr_t *) HW_FLEXIO_SHIFTERR_ADDR(x))
#define HW_FLEXIO_SHIFTERR_RD(x) (HW_FLEXIO_SHIFTERR(x).U)
#define HW_FLEXIO_SHIFTERR_WR(x, v) (HW_FLEXIO_SHIFTERR(x).U = (v))
#define HW_FLEXIO_SHIFTERR_SET(x, v) (BME_OR32(HW_FLEXIO_SHIFTERR_ADDR(x), (uint32_t)(v)))
#define HW_FLEXIO_SHIFTERR_CLR(x, v) (BME_AND32(HW_FLEXIO_SHIFTERR_ADDR(x), (uint32_t)(~(v))))
#define HW_FLEXIO_SHIFTERR_TOG(x, v) (BME_XOR32(HW_FLEXIO_SHIFTERR_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual FLEXIO_SHIFTERR bitfields
 */

/*!
 * @name Register FLEXIO_SHIFTERR, field SEF[3:0] (W1C)
 *
 * The shifter error flag is set when one of the following events occurs: For
 * SMOD=Receive, indicates Shifter was ready to store new data into SHIFTBUF before
 * the previous data was read from SHIFTBUF (SHIFTBUF Overrun), or indicates
 * that the received start or stop bit does not match the expected value. For
 * SMOD=Transmit, indicates Shifter was ready to load new data from SHIFTBUF before new
 * data had been written into SHIFTBUF (SHIFTBUF Underrun). For SMOD=Match
 * Store, indicates a match event occured before the previous match data was read from
 * SHIFTBUF (SHIFTBUF Overrun). For SMOD=Match Continuous, the error flag is set
 * when a match has occured between SHIFTBUF and Shifter. Can be cleared by
 * writing logic one to the flag. For SMOD=Match Continuous, can also be cleared when
 * the SHIFTBUF register is read.
 *
 * Values:
 * - 0 - Shifter Error Flag is clear
 * - 1 - Shifter Error Flag is set
 */
/*@{*/
#define BP_FLEXIO_SHIFTERR_SEF (0U)        /*!< Bit position for FLEXIO_SHIFTERR_SEF. */
#define BM_FLEXIO_SHIFTERR_SEF (0x0000000FU) /*!< Bit mask for FLEXIO_SHIFTERR_SEF. */
#define BS_FLEXIO_SHIFTERR_SEF (4U)        /*!< Bit field size in bits for FLEXIO_SHIFTERR_SEF. */

/*! @brief Read current value of the FLEXIO_SHIFTERR_SEF field. */
#define BR_FLEXIO_SHIFTERR_SEF(x) (BME_UBFX32(HW_FLEXIO_SHIFTERR_ADDR(x), BP_FLEXIO_SHIFTERR_SEF, BS_FLEXIO_SHIFTERR_SEF))

/*! @brief Format value for bitfield FLEXIO_SHIFTERR_SEF. */
#define BF_FLEXIO_SHIFTERR_SEF(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_SHIFTERR_SEF) & BM_FLEXIO_SHIFTERR_SEF)

/*! @brief Set the SEF field to a new value. */
#define BW_FLEXIO_SHIFTERR_SEF(x, v) (BME_BFI32(HW_FLEXIO_SHIFTERR_ADDR(x), ((uint32_t)(v) << BP_FLEXIO_SHIFTERR_SEF), BP_FLEXIO_SHIFTERR_SEF, 4))
/*@}*/

/*******************************************************************************
 * HW_FLEXIO_TIMSTAT - Timer Status Register
 ******************************************************************************/

/*!
 * @brief HW_FLEXIO_TIMSTAT - Timer Status Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
typedef union _hw_flexio_timstat
{
    uint32_t U;
    struct _hw_flexio_timstat_bitfields
    {
        uint32_t TSF : 4;              /*!< [3:0] Timer Status Flags */
        uint32_t RESERVED0 : 28;       /*!< [31:4]  */
    } B;
} hw_flexio_timstat_t;

/*!
 * @name Constants and macros for entire FLEXIO_TIMSTAT register
 */
/*@{*/
#define HW_FLEXIO_TIMSTAT_ADDR(x) ((x) + 0x18U)

#define HW_FLEXIO_TIMSTAT(x)     (*(__IO hw_flexio_timstat_t *) HW_FLEXIO_TIMSTAT_ADDR(x))
#define HW_FLEXIO_TIMSTAT_RD(x)  (HW_FLEXIO_TIMSTAT(x).U)
#define HW_FLEXIO_TIMSTAT_WR(x, v) (HW_FLEXIO_TIMSTAT(x).U = (v))
#define HW_FLEXIO_TIMSTAT_SET(x, v) (BME_OR32(HW_FLEXIO_TIMSTAT_ADDR(x), (uint32_t)(v)))
#define HW_FLEXIO_TIMSTAT_CLR(x, v) (BME_AND32(HW_FLEXIO_TIMSTAT_ADDR(x), (uint32_t)(~(v))))
#define HW_FLEXIO_TIMSTAT_TOG(x, v) (BME_XOR32(HW_FLEXIO_TIMSTAT_ADDR(x), (uint32_t)(v)))
/*@}*/

