nevinxu/HM502B2/platform/CMSIS/Include/device/MKL17Z4/MKL17Z4_flexio.h
/*
 * Constants & macros for individual FLEXIO_TIMSTAT bitfields
 */

/*!
 * @name Register FLEXIO_TIMSTAT, field TSF[3:0] (W1C)
 *
 * The timer status flag sets depending on the timer mode, and can be cleared by
 * writing logic one to the flag. In 8-bit counter mode, the timer status flag
 * is set when the upper 8-bit counter equals zero and decrements, this also
 * causes the counter to reload with the value in the compare register. In 8-bit PWM
 * mode, the timer status flag is set when the upper 8-bit counter equals zero and
 * decrements, this also causes the counter to reload with the value in the
 * compare register.. In 16-bit counter mode, the timer status flag is set when the
 * 16-bit counter equals zero and decrements, this also causes the counter to
 * reload with the value in the compare register..
 *
 * Values:
 * - 0 - Timer Status Flag is clear
 * - 1 - Timer Status Flag is set
 */
/*@{*/
#define BP_FLEXIO_TIMSTAT_TSF (0U)         /*!< Bit position for FLEXIO_TIMSTAT_TSF. */
#define BM_FLEXIO_TIMSTAT_TSF (0x0000000FU) /*!< Bit mask for FLEXIO_TIMSTAT_TSF. */
#define BS_FLEXIO_TIMSTAT_TSF (4U)         /*!< Bit field size in bits for FLEXIO_TIMSTAT_TSF. */

/*! @brief Read current value of the FLEXIO_TIMSTAT_TSF field. */
#define BR_FLEXIO_TIMSTAT_TSF(x) (BME_UBFX32(HW_FLEXIO_TIMSTAT_ADDR(x), BP_FLEXIO_TIMSTAT_TSF, BS_FLEXIO_TIMSTAT_TSF))

/*! @brief Format value for bitfield FLEXIO_TIMSTAT_TSF. */
#define BF_FLEXIO_TIMSTAT_TSF(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMSTAT_TSF) & BM_FLEXIO_TIMSTAT_TSF)

/*! @brief Set the TSF field to a new value. */
#define BW_FLEXIO_TIMSTAT_TSF(x, v) (BME_BFI32(HW_FLEXIO_TIMSTAT_ADDR(x), ((uint32_t)(v) << BP_FLEXIO_TIMSTAT_TSF), BP_FLEXIO_TIMSTAT_TSF, 4))
/*@}*/

/*******************************************************************************
 * HW_FLEXIO_SHIFTSIEN - Shifter Status Interrupt Enable
 ******************************************************************************/

/*!
 * @brief HW_FLEXIO_SHIFTSIEN - Shifter Status Interrupt Enable (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
typedef union _hw_flexio_shiftsien
{
    uint32_t U;
    struct _hw_flexio_shiftsien_bitfields
    {
        uint32_t SSIE : 4;             /*!< [3:0] Shifter Status Interrupt Enable */
        uint32_t RESERVED0 : 28;       /*!< [31:4]  */
    } B;
} hw_flexio_shiftsien_t;

/*!
 * @name Constants and macros for entire FLEXIO_SHIFTSIEN register
 */
/*@{*/
#define HW_FLEXIO_SHIFTSIEN_ADDR(x) ((x) + 0x20U)

#define HW_FLEXIO_SHIFTSIEN(x)   (*(__IO hw_flexio_shiftsien_t *) HW_FLEXIO_SHIFTSIEN_ADDR(x))
#define HW_FLEXIO_SHIFTSIEN_RD(x) (HW_FLEXIO_SHIFTSIEN(x).U)
#define HW_FLEXIO_SHIFTSIEN_WR(x, v) (HW_FLEXIO_SHIFTSIEN(x).U = (v))
#define HW_FLEXIO_SHIFTSIEN_SET(x, v) (BME_OR32(HW_FLEXIO_SHIFTSIEN_ADDR(x), (uint32_t)(v)))
#define HW_FLEXIO_SHIFTSIEN_CLR(x, v) (BME_AND32(HW_FLEXIO_SHIFTSIEN_ADDR(x), (uint32_t)(~(v))))
#define HW_FLEXIO_SHIFTSIEN_TOG(x, v) (BME_XOR32(HW_FLEXIO_SHIFTSIEN_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual FLEXIO_SHIFTSIEN bitfields
 */

/*!
 * @name Register FLEXIO_SHIFTSIEN, field SSIE[3:0] (RW)
 *
 * Enables interrupt generation when corresponding SSF is set.
 *
 * Values:
 * - 0 - Shifter Status Flag interrupt disabled
 * - 1 - Shifter Status Flag interrupt enabled
 */
/*@{*/
#define BP_FLEXIO_SHIFTSIEN_SSIE (0U)      /*!< Bit position for FLEXIO_SHIFTSIEN_SSIE. */
#define BM_FLEXIO_SHIFTSIEN_SSIE (0x0000000FU) /*!< Bit mask for FLEXIO_SHIFTSIEN_SSIE. */
#define BS_FLEXIO_SHIFTSIEN_SSIE (4U)      /*!< Bit field size in bits for FLEXIO_SHIFTSIEN_SSIE. */

/*! @brief Read current value of the FLEXIO_SHIFTSIEN_SSIE field. */
#define BR_FLEXIO_SHIFTSIEN_SSIE(x) (BME_UBFX32(HW_FLEXIO_SHIFTSIEN_ADDR(x), BP_FLEXIO_SHIFTSIEN_SSIE, BS_FLEXIO_SHIFTSIEN_SSIE))

/*! @brief Format value for bitfield FLEXIO_SHIFTSIEN_SSIE. */
#define BF_FLEXIO_SHIFTSIEN_SSIE(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_SHIFTSIEN_SSIE) & BM_FLEXIO_SHIFTSIEN_SSIE)

/*! @brief Set the SSIE field to a new value. */
#define BW_FLEXIO_SHIFTSIEN_SSIE(x, v) (BME_BFI32(HW_FLEXIO_SHIFTSIEN_ADDR(x), ((uint32_t)(v) << BP_FLEXIO_SHIFTSIEN_SSIE), BP_FLEXIO_SHIFTSIEN_SSIE, 4))
/*@}*/

/*******************************************************************************
 * HW_FLEXIO_SHIFTEIEN - Shifter Error Interrupt Enable
 ******************************************************************************/

/*!
 * @brief HW_FLEXIO_SHIFTEIEN - Shifter Error Interrupt Enable (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
typedef union _hw_flexio_shifteien
{
    uint32_t U;
    struct _hw_flexio_shifteien_bitfields
    {
        uint32_t SEIE : 4;             /*!< [3:0] Shifter Error Interrupt Enable */
        uint32_t RESERVED0 : 28;       /*!< [31:4]  */
    } B;
} hw_flexio_shifteien_t;

/*!
 * @name Constants and macros for entire FLEXIO_SHIFTEIEN register
 */
/*@{*/
#define HW_FLEXIO_SHIFTEIEN_ADDR(x) ((x) + 0x24U)

#define HW_FLEXIO_SHIFTEIEN(x)   (*(__IO hw_flexio_shifteien_t *) HW_FLEXIO_SHIFTEIEN_ADDR(x))
#define HW_FLEXIO_SHIFTEIEN_RD(x) (HW_FLEXIO_SHIFTEIEN(x).U)
#define HW_FLEXIO_SHIFTEIEN_WR(x, v) (HW_FLEXIO_SHIFTEIEN(x).U = (v))
#define HW_FLEXIO_SHIFTEIEN_SET(x, v) (BME_OR32(HW_FLEXIO_SHIFTEIEN_ADDR(x), (uint32_t)(v)))
#define HW_FLEXIO_SHIFTEIEN_CLR(x, v) (BME_AND32(HW_FLEXIO_SHIFTEIEN_ADDR(x), (uint32_t)(~(v))))
#define HW_FLEXIO_SHIFTEIEN_TOG(x, v) (BME_XOR32(HW_FLEXIO_SHIFTEIEN_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual FLEXIO_SHIFTEIEN bitfields
 */

/*!
 * @name Register FLEXIO_SHIFTEIEN, field SEIE[3:0] (RW)
 *
 * Enables interrupt generation when corresponding SEF is set.
 *
 * Values:
 * - 0 - Shifter Error Flag interrupt disabled
 * - 1 - Shifter Error Flag interrupt enabled
 */
/*@{*/
#define BP_FLEXIO_SHIFTEIEN_SEIE (0U)      /*!< Bit position for FLEXIO_SHIFTEIEN_SEIE. */
#define BM_FLEXIO_SHIFTEIEN_SEIE (0x0000000FU) /*!< Bit mask for FLEXIO_SHIFTEIEN_SEIE. */
#define BS_FLEXIO_SHIFTEIEN_SEIE (4U)      /*!< Bit field size in bits for FLEXIO_SHIFTEIEN_SEIE. */

/*! @brief Read current value of the FLEXIO_SHIFTEIEN_SEIE field. */
#define BR_FLEXIO_SHIFTEIEN_SEIE(x) (BME_UBFX32(HW_FLEXIO_SHIFTEIEN_ADDR(x), BP_FLEXIO_SHIFTEIEN_SEIE, BS_FLEXIO_SHIFTEIEN_SEIE))

/*! @brief Format value for bitfield FLEXIO_SHIFTEIEN_SEIE. */
#define BF_FLEXIO_SHIFTEIEN_SEIE(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_SHIFTEIEN_SEIE) & BM_FLEXIO_SHIFTEIEN_SEIE)

/*! @brief Set the SEIE field to a new value. */
#define BW_FLEXIO_SHIFTEIEN_SEIE(x, v) (BME_BFI32(HW_FLEXIO_SHIFTEIEN_ADDR(x), ((uint32_t)(v) << BP_FLEXIO_SHIFTEIEN_SEIE), BP_FLEXIO_SHIFTEIEN_SEIE, 4))
/*@}*/

