nevinxu/HM502B2/platform/CMSIS/Include/device/MKL17Z4/MKL17Z4_flexio.h
/*******************************************************************************
 * HW_FLEXIO_SHIFTBUFn - Shifter Buffer N Register
 ******************************************************************************/

/*!
 * @brief HW_FLEXIO_SHIFTBUFn - Shifter Buffer N Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
typedef union _hw_flexio_shiftbufn
{
    uint32_t U;
    struct _hw_flexio_shiftbufn_bitfields
    {
        uint32_t SHIFTBUF : 32;        /*!< [31:0] Shift Buffer */
    } B;
} hw_flexio_shiftbufn_t;

/*!
 * @name Constants and macros for entire FLEXIO_SHIFTBUFn register
 */
/*@{*/
#define HW_FLEXIO_SHIFTBUFn_COUNT (4U)

#define HW_FLEXIO_SHIFTBUFn_ADDR(x, n) ((x) + 0x200U + (0x4U * (n)))

#define HW_FLEXIO_SHIFTBUFn(x, n) (*(__IO hw_flexio_shiftbufn_t *) HW_FLEXIO_SHIFTBUFn_ADDR(x, n))
#define HW_FLEXIO_SHIFTBUFn_RD(x, n) (HW_FLEXIO_SHIFTBUFn(x, n).U)
#define HW_FLEXIO_SHIFTBUFn_WR(x, n, v) (HW_FLEXIO_SHIFTBUFn(x, n).U = (v))
#define HW_FLEXIO_SHIFTBUFn_SET(x, n, v) (BME_OR32(HW_FLEXIO_SHIFTBUFn_ADDR(x, n), (uint32_t)(v)))
#define HW_FLEXIO_SHIFTBUFn_CLR(x, n, v) (BME_AND32(HW_FLEXIO_SHIFTBUFn_ADDR(x, n), (uint32_t)(~(v))))
#define HW_FLEXIO_SHIFTBUFn_TOG(x, n, v) (BME_XOR32(HW_FLEXIO_SHIFTBUFn_ADDR(x, n), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual FLEXIO_SHIFTBUFn bitfields
 */

/*!
 * @name Register FLEXIO_SHIFTBUFn, field SHIFTBUF[31:0] (RW)
 *
 * Shift buffer data is used for a variety of functions depending on the SMOD
 * setting: For SMOD=Receive, Shifter data is transferred into SHIFTBUF at the
 * expiration of Timer. For SMOD=Transmit, SHIFTBUF data is transferred into the
 * Shifter before the Timer begins. For SMOD=Match Store/Continuous, SHIFTBUF[31:16]
 * contains the data to be matched with the Shifter contents. The Match is
 * checked either continuosly (Match Continous mode) or when the Timer expires (Match
 * Store mode). SHIFTBUF[15:0] can be used to mask the match result (1=mask, 0=no
 * mask). In Match Store mode, Shifter data [31:16] is written to SHIFTBUF[31:16]
 * whenever a match event occurs.
 */
/*@{*/
#define BP_FLEXIO_SHIFTBUFn_SHIFTBUF (0U)  /*!< Bit position for FLEXIO_SHIFTBUFn_SHIFTBUF. */
#define BM_FLEXIO_SHIFTBUFn_SHIFTBUF (0xFFFFFFFFU) /*!< Bit mask for FLEXIO_SHIFTBUFn_SHIFTBUF. */
#define BS_FLEXIO_SHIFTBUFn_SHIFTBUF (32U) /*!< Bit field size in bits for FLEXIO_SHIFTBUFn_SHIFTBUF. */

/*! @brief Read current value of the FLEXIO_SHIFTBUFn_SHIFTBUF field. */
#define BR_FLEXIO_SHIFTBUFn_SHIFTBUF(x, n) (HW_FLEXIO_SHIFTBUFn(x, n).U)

/*! @brief Format value for bitfield FLEXIO_SHIFTBUFn_SHIFTBUF. */
#define BF_FLEXIO_SHIFTBUFn_SHIFTBUF(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_SHIFTBUFn_SHIFTBUF) & BM_FLEXIO_SHIFTBUFn_SHIFTBUF)

/*! @brief Set the SHIFTBUF field to a new value. */
#define BW_FLEXIO_SHIFTBUFn_SHIFTBUF(x, n, v) (HW_FLEXIO_SHIFTBUFn_WR(x, n, v))
/*@}*/

/*******************************************************************************
 * HW_FLEXIO_SHIFTBUFBBSn - Shifter Buffer N Bit Byte Swapped Register
 ******************************************************************************/

/*!
 * @brief HW_FLEXIO_SHIFTBUFBBSn - Shifter Buffer N Bit Byte Swapped Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
typedef union _hw_flexio_shiftbufbbsn
{
    uint32_t U;
    struct _hw_flexio_shiftbufbbsn_bitfields
    {
        uint32_t SHIFTBUFBBS : 32;     /*!< [31:0] Shift Buffer */
    } B;
} hw_flexio_shiftbufbbsn_t;

/*!
 * @name Constants and macros for entire FLEXIO_SHIFTBUFBBSn register
 */
/*@{*/
#define HW_FLEXIO_SHIFTBUFBBSn_COUNT (4U)

#define HW_FLEXIO_SHIFTBUFBBSn_ADDR(x, n) ((x) + 0x280U + (0x4U * (n)))

#define HW_FLEXIO_SHIFTBUFBBSn(x, n) (*(__IO hw_flexio_shiftbufbbsn_t *) HW_FLEXIO_SHIFTBUFBBSn_ADDR(x, n))
#define HW_FLEXIO_SHIFTBUFBBSn_RD(x, n) (HW_FLEXIO_SHIFTBUFBBSn(x, n).U)
#define HW_FLEXIO_SHIFTBUFBBSn_WR(x, n, v) (HW_FLEXIO_SHIFTBUFBBSn(x, n).U = (v))
#define HW_FLEXIO_SHIFTBUFBBSn_SET(x, n, v) (BME_OR32(HW_FLEXIO_SHIFTBUFBBSn_ADDR(x, n), (uint32_t)(v)))
#define HW_FLEXIO_SHIFTBUFBBSn_CLR(x, n, v) (BME_AND32(HW_FLEXIO_SHIFTBUFBBSn_ADDR(x, n), (uint32_t)(~(v))))
#define HW_FLEXIO_SHIFTBUFBBSn_TOG(x, n, v) (BME_XOR32(HW_FLEXIO_SHIFTBUFBBSn_ADDR(x, n), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual FLEXIO_SHIFTBUFBBSn bitfields
 */

/*!
 * @name Register FLEXIO_SHIFTBUFBBSn, field SHIFTBUFBBS[31:0] (RW)
 *
 * Alias to SHIFTBUF register, except reads/writes to this register are bit
 * swapped within each byte. Reads return { SHIFTBUF[24:31], SHIFTBUF[16:23],
 * SHIFTBUF[8:15], SHIFTBUF[0:7] }.
 */
/*@{*/
#define BP_FLEXIO_SHIFTBUFBBSn_SHIFTBUFBBS (0U) /*!< Bit position for FLEXIO_SHIFTBUFBBSn_SHIFTBUFBBS. */
#define BM_FLEXIO_SHIFTBUFBBSn_SHIFTBUFBBS (0xFFFFFFFFU) /*!< Bit mask for FLEXIO_SHIFTBUFBBSn_SHIFTBUFBBS. */
#define BS_FLEXIO_SHIFTBUFBBSn_SHIFTBUFBBS (32U) /*!< Bit field size in bits for FLEXIO_SHIFTBUFBBSn_SHIFTBUFBBS. */

/*! @brief Read current value of the FLEXIO_SHIFTBUFBBSn_SHIFTBUFBBS field. */
#define BR_FLEXIO_SHIFTBUFBBSn_SHIFTBUFBBS(x, n) (HW_FLEXIO_SHIFTBUFBBSn(x, n).U)

/*! @brief Format value for bitfield FLEXIO_SHIFTBUFBBSn_SHIFTBUFBBS. */
#define BF_FLEXIO_SHIFTBUFBBSn_SHIFTBUFBBS(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_SHIFTBUFBBSn_SHIFTBUFBBS) & BM_FLEXIO_SHIFTBUFBBSn_SHIFTBUFBBS)

/*! @brief Set the SHIFTBUFBBS field to a new value. */
#define BW_FLEXIO_SHIFTBUFBBSn_SHIFTBUFBBS(x, n, v) (HW_FLEXIO_SHIFTBUFBBSn_WR(x, n, v))
/*@}*/

/*******************************************************************************
 * HW_FLEXIO_SHIFTBUFBYSn - Shifter Buffer N Byte Swapped Register
 ******************************************************************************/

/*!
 * @brief HW_FLEXIO_SHIFTBUFBYSn - Shifter Buffer N Byte Swapped Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
typedef union _hw_flexio_shiftbufbysn
{
    uint32_t U;
    struct _hw_flexio_shiftbufbysn_bitfields
    {
        uint32_t SHIFTBUFBYS : 32;     /*!< [31:0] Shift Buffer */
    } B;
} hw_flexio_shiftbufbysn_t;

/*!
 * @name Constants and macros for entire FLEXIO_SHIFTBUFBYSn register
 */
/*@{*/
#define HW_FLEXIO_SHIFTBUFBYSn_COUNT (4U)

